{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "name": "encoder_inputs", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 100], "name": "encoder_inputs", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "decoder_inputs", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 100], "name": "decoder_inputs", "dtype": "float32", "sparse": false}}, {"class_name": "LSTM", "name": "encoder_lstm", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "config": {"go_backwards": false, "recurrent_dropout": 0.0, "return_state": true, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "activity_regularizer": null, "name": "encoder_lstm", "kernel_constraint": null, "unroll": false, "implementation": 1, "use_bias": true, "trainable": true, "unit_forget_bias": true, "return_sequences": false}}, {"class_name": "LSTM", "name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "config": {"go_backwards": false, "recurrent_dropout": 0.0, "return_state": true, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "activity_regularizer": null, "name": "decoder_lstm", "kernel_constraint": null, "unroll": false, "implementation": 1, "use_bias": true, "trainable": true, "unit_forget_bias": true, "return_sequences": true}}, {"class_name": "Dense", "name": "decoder_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "config": {"units": 795, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "name": "decoder_dense", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null}}], "name": "model_1", "output_layers": [["decoder_dense", 0, 0]], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}, "backend": "tensorflow"}